Revit 2027 API
ParameterTypeId.StructuralFoundationWidth Property
 "Width"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralFoundationWidth { get; }
Public Shared ReadOnly Property StructuralFoundationWidth As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralFoundationWidth {
	ForgeTypeId^ get ();
}
static member StructuralFoundationWidth : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace